Tekla Open API Reference for Tekla Structures 2025
SinglePartDrawing Constructor (Identifier)
 Instantiates a new single part drawing with standard attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public SinglePartDrawing(
	Identifier partIdentifier
)
Public Sub New (
	partIdentifier As Identifier
)
Parameters
partIdentifier
Type: Tekla.Structures.Identifier
The identifier of the model object part
See Also
Reference
SinglePartDrawing Class
SinglePartDrawing Overload
Tekla.Structures.Drawing Namespace